console.log('number' + 3 + 3)  // все приводиться до строки та конткатинується, результат "number33"
console.log(null + 3) //нал це нуль і ми додаємо цифру до нуля ,результат 3
console.log(5 && "qwerty")// Пояснення: Оператор "&&" повертає другий операнд, якщо обидва істинні. У цьому випадку обидва значення істинні, тож результат - "qwerty".
console.log(+'40' + +'2' + "hillel")// "+" перед рядками перетворює їх на числа. Сума 40 і 2 дорівнює 42, а потім додається рядок "hillel".
console.log('10' - 5 === 6)//Оператор "-" перетворює '10' на число 10, і потім порівнюємо, чи дорівнює 10 - 5 6. Результат - false.
console.log(true + false)// js приводить тру і фолс до цифрового вигляду, тому вихрдить 1+0=1
console.log('4px' - 3)//  Рядок '4px' не може бути віднятий від числа, тому результат - NaN
console.log('4' - 3)// Рядок '4' перетворюється на число 4, і вираз 4 - 3 дорівнює 1.
console.log('6' + 3 ** 0)//  3 ** 0 дорівнює 1, і це додається до рядка '6', отримуючи "61".
console.log(12 / '6')// Рядок '6' перетворюється на число 6, і вираз 12 / 6 дорівнює 2.
console.log('10' + (5 === 6))//Внутрішній вираз (5 === 6) порівнює 5 з 6 і повертає false. Потім цей результат об'єднується з рядком '10', отримуючи "10false".
console.log(null == '')// Вони не рівні один одному, тому результат - false.
console.log(3 ** (9 / 3))//початку вираховується вираз в дужках: 9 / 3 = 3.Потім 3 підноситься до ступеня 3, отримуючи 27.
console.log(!!'false' == !!'true')//Оператор !! конвертує рядки 'false' і 'true' в логічні значення, отримуючи false і true відповідно.Потім порівнюються ці логічні значення, і вони є рівними, отже, результат - true.
console.log(0 || '0' && 1)//Оператор || повертає перший істинний операнд або останній операнд, якщо немає істинних значень.Вираз '0' && 1 оцінюється як '0', оскільки обидва операнди істинні (рядок '0' перетворено на true).
console.log((+null == false) < 1)//Спочатку null перетворюється на число 0.Порівнюється 0 == false, що є істинним, але обидва значення порівнюються як false.Потім false < 1 - false менше 1, і результат - true.
console.log(false && true || true)//Спочатку вираз false && true оцінюється як false, оскільки false інтерпретується як "істина".Далі false || true - true, оскільки оператор || повертає перший істинний операнд або останній операнд
console.log(false && (false || true))//Вираз false || true оцінюється як true, оскільки оператор || повертає перший істинний операнд.Потім false && true оцінюється як false, оскільки false інтерпретується як "істина".Результат - false
console.log((+null == false) < 1 ** 5)//Спочатку null перетворюється на число 0.Порівнюється 0 == false, що є істинним, але обидва значення порівнюються як false.Потім 1 ** 5 обчислюється як 1, оскільки будь-яке число, піднесене до ступеня 1, залишається незмінним.Нарешті, false < 1 - false менше 1, і результат - true.
